JohnTickets/src/test.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope 
           xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
           xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
           xmlns:ns1="http://api.affiliatewindow.com/">
 
<SOAP-ENV:Header>
<ns1:UserAuthentication 
           SOAP-ENV:mustUnderstand="1" 
           SOAP-ENV:actor="http://api.affiliatewindow.com">
           <ns1:iId>johnshaterian@gmail.com</ns1:iId>
           <ns1:sPassword>Oakland1357@</ns1:sPassword>
           <ns1:sType>affiliate</ ns1:sType>
</ns1:UserAuthentication>
 
<ns1:getQuota SOAP-ENV:mustUnderstand="1" SOAP-ENV:actor="http://api.affiliatewindow.com">true</ns1:getQuota>
</SOAP-ENV:Header>
 
<SOAP-ENV:Body>
       <ns1:getTransactionList>
           <ns1:dStartDate>2006-08-04T00:00:00</ns1:dStartDate>
           <ns1:dEndDate>2006-08-14T23:59:59</ns1:dEndDate>
           <ns1:sDateType>transaction</ns1:sDateType>
       </ns1:getTransactionList>
</SOAP-ENV:Body>
 
</SOAP-ENV:Envelope>

